Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Its purpose is to simplify the debugging of VG-Lite GPU adaptation and reduce the time spent debugging and locating problems on hardware devices.
it_it: Il suo scopo è semplificare il debug dell'adattamento di GPU VG-Lite e ridurre il tempo impiegato per il debug e l'individuazione dei problemi sui dispositivi hardware.

source: Its purpose is to simplify the debugging of VG-Lite adaptation and reduce the time of debugging and locating problems on hardware devices.
it_it: Il suo scopo è semplificare il debug dell'adattamento VG-Lite e ridurre i tempi di debug e individuazione dei problemi sui dispositivi hardware.

source: Its type is already in ``dsc->src_type == LV_IMG_SRC_FILE/VARIABLE``.
it_it: Il suo tipo è già in ``dsc->src_type == LV_IMG_SRC_FILE/VARIABLE``.

source: It’s especially beneficial if:
it_it: È particolarmente utile se:

source: JLink is used for debugging, it can be downloaded `here <https://www.segger.com/downloads/jlink/>`__.
it_it: JLink viene utilizzato per il debug e può essere scaricato `qui <https://www.segger.com/downloads/jlink/>`__.

source: JPEG is decoded in 8x8 tiles.
it_it: Il JPEG viene decodificato in riquadri 8x8.

source: JPEG: Only a few pixels are read and drawn at once.
it_it: JPEG: solo pochi pixel vengono letti e disegnati contemporaneamente.

source: JPG, PNG, and WebP compressed texture support
it_it: Supporto texture compresse JPG, PNG e WebP

source: JS Bundle
it_it: Bundle JS

source: JSON format was chosen because there are libraries for reading JSON data in almost every programming language.
it_it: Il formato JSON è stato scelto perché esistono librerie per la lettura di dati JSON in quasi tutti i linguaggi di programmazione.

source: Jan, 2022
it_it: Gen, 2022

source: Jan, 2023
it_it: Gen, 2023

source: Jan, 2024
it_it: Gen, 2024

source: Jan, 2025
it_it: Gen, 2025

source: Join LVGL's community and leave your footprint in the library!
it_it: Unirsi alla community di LVGL e lasciare il segno nella libreria!

source: Just add ``<slot name="my_slot"/>`` to the ``<api>`` to tell the Editor which children to expose.
it_it: Basta aggiungere ``<slot name="my_slot"/>`` a ``<api>`` per indicare all'editor quali elementi figlio esporre.

source: Just click the link!
it_it: Basta cliccare sul link!

source: Just create a group with :cpp:expr:`lv_group_t * g = lv_group_create()` and set the default group with :cpp:expr:`lv_group_set_default(g)`.
it_it: Basta creare un gruppo con :cpp:expr:`lv_group_t * g = lv_group_create()` e impostare il gruppo di default con :cpp:expr:`lv_group_set_default(g)`.

source: Just download either the ARM (for Apple Silicon) or AMD version and drag the application to your Applications folder in Finder.
it_it: Basta scaricare la versione ARM (per Apple Silicon) o AMD e trascinare l'applicazione nella cartella "Applications" del Finder.

source: Just follow the README of the repositories listed below.
it_it: Basta seguire il README dei repository elencati di seguito.

source: Just like Components, Widgets can also be children of other Widgets and Components.
it_it: Proprio come i Componenti, anche i Widget possono essere figli di altri Widget e Componenti.

source: Just like any other Widget API properties, Elements can also be defined in the ``<api>`` tag of the Widget's XML.
it_it: Come qualsiasi altra proprietà dell'API del Widget, anche gli Elementi possono essere definiti nel tag ``<api>`` dell'XML Widget.

source: Just make sure the ID is unique across all Widgets.
it_it: Assicurarsi solo che l'ID sia univoco in tutti i Widget.

source: Just remember that the Interpreted Text Role names combine the letters i, b and u to provide the desired combination.
it_it: Da ricordare che i nomi degli "Interpreted Text Role" combinano le lettere i, b e u per fornire la combinazione desiderata.

source: Just set ``data->enc_diff`` to the number of rotary steps, and LVGL will automatically send the :cpp:enumerator:`LV_EVENT_ROTARY` event or scroll the widget based on the ``editable`` flag in the widget's class.
it_it: È sufficiente impostare ``data->enc_diff`` sul numero di passi di rotazione e LVGL invierà automaticamente l'evento :cpp:enumerator:`LV_EVENT_ROTARY` o farà scorrere il widget in base al flag ``editable`` nella classe del widget.

source: Just set the parameters, click the *Convert* button, copy the font to your project and use it.
it_it: Basta impostare i parametri, cliccare sul pulsante *Convert*, copiare il font nel progetto e utilizzarlo.

source: Just transfer the buffer received in the first display's :ref:`flush_callback` to the other display as well.
it_it: È sufficiente trasferire il buffer ricevuto nella :ref:`flush_callback` del primo display anche all'altro display.

source: Just write the Python interface in pika_lvgl.pyi (.pyi is a Python interface file)
it_it: Basta scrivere l'interfaccia Python in pika_lvgl.pyi (.pyi è un file di interfaccia Python).

source: Keep in mind that using following keywords in the map will have the same effect as with the original map:
it_it: Tenere presente che l'utilizzo delle seguenti parole chiave nella mappa avrà lo stesso effetto della mappa originale:

source: Keep the display buffer in internal RAM (not in external SRAM) because LVGL uses it a lot and it should have fast access time.
it_it: Mantenere il buffer di visualizzazione nella RAM interna (non nella SRAM esterna) perché LVGL la utilizza molto e dovrebbe avere tempi di accesso rapidi.

source: Keep this in mind when Finding Widgets as described below.
it_it: Si tenga presente questo quando si cercano i widget come descritto di seguito.

source: Kerning
it_it: Crenatura

source: Key Buildroot components and concepts will be introduced.
it_it: Verranno introdotti i componenti e i concetti chiave di Buildroot.

source: Key Events
it_it: Eventi Chiave

source: Key Features
it_it: Caratteristiche Principali

source: Key Pop-Overs
it_it: Pop-over dei Tasti

source: Key Remapping
it_it: Rimappatura dei Tasti

source: Key customization
it_it: Personalizzazione dei tasti

source: Key features
it_it: Caratteristiche Principali

source: Key remapping functionality of indev can be used to implement this behavior.
it_it: La di rimappatura dei tasti di indev può essere utilizzata per implementare questo comportamento.

source: Keyboard
it_it: Tastiera

source: Keyboard navigation and interaction would require additional implementation.
it_it: La navigazione e l'interazione tramite tastiera richiederebbero un'implementazione aggiuntiva.

source: Keyboard with custom map
it_it: Tastiera con mappa personalizzata

source: Keyboard with drawing
it_it: Tastiera con disegno

source: Keyboard with text area
it_it: Tastiera con area di testo

source: Keyboards have the following modes:
it_it: Le tastiere hanno le seguenti modalità:

source: Keyframe-based animations for object transformations
it_it: Animazioni "keyframe-based" per le trasformazioni degli oggetti

source: Keypad and Keyboard
it_it: Keypad e Tastiera

source: Keys
it_it: Tasti

source: Keys have effect only on the tab buttons.
it_it: I tasti hanno effetto solo sui pulsanti delle schede.

source: Knob
it_it: Knob [maniglia]

source: Knob offset
it_it: Offset della manopola

source: Knob-only mode
it_it: Modalità solo manopola

source: Known Limitations
it_it: Limitazioni Note

source: Known limitations:
it_it: Limitazioni note:

source: L8 with an alpha byte
it_it: L8 con un byte alfa

source: LED with custom style
it_it: LED con stile personalizzato

source: LEDs are rectangle-like (or circle) Widgets whose brightness can be adjusted.
it_it: I LED sono Widget rettangolari (o circolari) la cui luminosità può essere regolata.

source: LINE chart: *line* properties are used by lines.
it_it: Grafico a LINEE: le proprietà *line* sono utilizzate dalle linee.

source: LINE-, BAR-, STACKED-charts require only one data-value array to supply Y-values for each data point.
it_it: I grafici LINE, BAR, STACKED richiedono un solo array di valori dati per fornire i valori Y per ogni punto dati.

source: LITTLEFS (a little fail-safe filesystem designed for microcontrollers)
it_it: LITTLEFS (un piccolo file system a prova di errore progettato per microcontrollori)

source: LTDC Layers
it_it: Layer LTDC

source: LTDC will use the DMA2D peripheral for flushing, if that is enabled.
it_it: LTDC utilizzerà la periferica DMA2D per il flushing, se abilitata.

source: LVGL (Light and Versatile Graphics Library) is a free and open-source C graphics library providing everything you need to create an embedded GUI with easy-to-use graphical elements, beautiful visual effects, and a low memory footprint.
it_it: LVGL (Light and Versatile Graphics Library) è una libreria grafica C gratuita e open source che fornisce tutto il necessario per creare un'interfaccia utente grafica embedded con elementi grafici facili da usare, splendidi effetti visivi e un ridotto utilizzo di memoria.

source: LVGL (Light and Versatile Graphics Library) is a free and open-source graphics library providing everything you need to create an embedded GUI with easy-to-use mobile-phone-like graphical elements, beautiful visual effects, and a low memory footprint.
it_it: LVGL (Light and Versatile Graphics Library) è una libreria grafica gratuita e open source che fornisce tutto il necessario per creare un'interfaccia utente grafica embedded con elementi grafici facili da usare, simili a quelli dei telefoni cellulari, splendidi effetti visivi e un ridotto utilizzo della memoria.

source: LVGL (global)
it_it: LVGL (globale)

source: LVGL C API Coding Conventions
it_it: Convenzioni di codifica dell'API C di LVGL

source: LVGL Data Flow
it_it: Il Data Flow di LVGL

source: LVGL EVE Display Creation
it_it: Creazione di un display LVGL per EVE

source: LVGL Integration Overview
it_it: Panoramica sull'Integrazione di LVGL

source: LVGL Pro Editor comes with a simple, scalable and royalty-free licensing model that works for open-source projects, startups, and enterprises alike.
it_it: LVGL Pro Editor è dotato di un modello di licenza semplice, scalabile e royalty-free, adatto a progetti open source, startup e aziende.

source: LVGL Pro and XML
it_it: LVGL Pro e XML

source: LVGL Pro is a complete toolkit to build, test, share, and ship embedded UIs efficiently.
it_it: LVGL Pro è un toolkit completo per creare, testare, condividere e distribuire interfacce utente integrate in modo efficiente.

source: LVGL Support for ESP32 Graphical Peripherals
it_it: Supporto LVGL per periferiche grafiche ESP32

source: LVGL Support for STM32 Graphical Peripherals
it_it: Supporto LVGL per Periferiche Grafiche STM32

source: LVGL Supported
it_it: Supporto LVGL

source: LVGL UIs can be rendered by EVE and are effectively indistinguishable from the software renderer is most cases.
it_it: Le interfacce utente LVGL possono essere renderizzate da EVE e nella maggior parte dei casi sono praticamente indistinguibili dal renderer software.

source: LVGL actively calls the GPU initialization function, and the SDK needs to implement the public function `gpu_init()`.
it_it: LVGL richiama attivamente la funzione di inizializzazione della GPU e l'SDK deve implementare la funzione pubblica `gpu_init()`.

source: LVGL already provides all the helper functions and required libraries.
it_it: LVGL fornisce già tutte le funzioni di supporto e le librerie necessarie.

source: LVGL also handles multiple displays at once.
it_it: LVGL gestisce anche più display contemporaneamente.

source: LVGL also supports ``make`` and ``CMake`` build systems out of the box.
it_it: LVGL è già pronto per supportare i sistemi di compilazione ``make`` e ``CMake``.

source: LVGL also supports several other font engines:
it_it: LVGL supporta anche diversi altri "font engine":

source: LVGL and Threads
it_it: LVGL e i Thread

source: LVGL application
it_it: Applicazione LVGL

source: LVGL calculates where the scroll would end considering scroll momentum;
it_it: LVGL calcola dove terminerebbe lo scorrimento considerando l'abbrivio dello scorrimento;

source: LVGL can also be configured using Kconfig. For now, this is only available using cmake.
it_it: LVGL può essere configurato anche tramite Kconfig. Per ora, questa funzionalità è disponibile solo tramite cmake.

source: LVGL can also be used without esp_lvgl_port, as described below.
it_it: LVGL può essere utilizzato anche senza esp_lvgl_port, come descritto di seguito.

source: LVGL can be easily integrated into any Makefile project by adding ``include lvgl/lvgl.mk`` to the main ``Makefile``.
it_it: LVGL può essere facilmente integrato in qualsiasi progetto Makefile aggiungendo ``include lvgl/lvgl.mk`` al ``Makefile`` principale.

source: LVGL can be freely extended by a custom layout like this:
it_it: LVGL può essere liberamente esteso con un layout personalizzato come questo:

source: LVGL can be installed via the Arduino IDE Library Manager or as a .ZIP library.
it_it: LVGL può essere installato tramite l'Arduino IDE Library Manager o come libreria .ZIP.

source: LVGL can be used and configured as a standard `ESP-IDF <https://github.com/espressif/esp-idf>`__ component.
it_it: LVGL può essere utilizzato e configurato come componente standard `ESP-IDF <https://github.com/espressif/esp-idf>`__.

source: LVGL can display debug information in case of trouble.
it_it: LVGL può visualizzare informazioni di debug in caso di problemi.

source: LVGL can efficiently handle very long (e.g. > 40k characters) Labels by saving some extra data (~12 bytes) to speed up drawing.
it_it: LVGL può gestire in modo efficiente etichette molto lunghe (ad esempio > 40k caratteri) risparmiando alcuni dati extra (~12 byte) per velocizzare il disegno.

source: LVGL can use GUIs that are 100% defined in C code you write (for which any updates to the GUI require modifying that C code and re-flashing the firmware), or GUI definitions provided in XML files (for which updates to the GUI require only modifying the XML files that define the GUI for that firmware), or any combination of these two that suits your project.
it_it: LVGL può utilizzare GUI definite al 100% nel codice C scritto dall'utente (per cui qualsiasi aggiornamento alla GUI richiede la modifica del codice C e il re-flashing del firmware), oppure definizioni di GUI in file XML (per cui gli aggiornamenti alla GUI richiedono solo la modifica dei file XML che definiscono la GUI per quel firmware), o qualsiasi combinazione di queste due opzioni adatta al progetto.

source: LVGL can use any number of displays.
it_it: LVGL può utilizzare un numero qualsiasi di display.

source: LVGL comes packaged with various tools that can help you debug problems you may encounter during development and testing.
it_it: LVGL include vari strumenti che possono aiutare a risolvere i problemi che si potrebbero incontrare durante lo sviluppo e il test.

source: LVGL comes with a lot of built-in Linux-related drivers and support:
it_it: LVGL include numerosi driver e supporto integrati per Linux:

source: LVGL comes with a number of image decoders to support a number of popular image formats:
it_it: LVGL è dotato di diversi decoder di immagini per supportare diversi formati comuni:

source: LVGL comes with a wide range of examples and demo applications that you can try out in PlatformIO.
it_it: LVGL include un'ampia gamma di esempi e applicazioni demo che si possono provare in PlatformIO.

source: LVGL comes with built-in drivers for Windows, covering:
it_it: LVGL include driver integrati per Windows, che includono:

source: LVGL comes with two very powerful layouts:
it_it: LVGL include due layout molto potenti:

source: LVGL contains prepared drivers for the API of POSIX, standard C, Windows, and `FATFS <http://elm-chan.org/fsw/ff/00index_e.html>`__.
it_it: LVGL contiene driver pronti per le API di POSIX, C standard, Windows e `FATFS <http://elm-chan.org/fsw/ff/00index_e.html>`__.

source: LVGL continues running, including animations and timers.
it_it: LVGL continua a funzionare, incluse animazioni e timer.

source: LVGL documentation uses reStructuredText (reST), rendered into HTML by Sphinx.
it_it: La documentazione LVGL utilizza reStructuredText (reST), trasformato in HTML da Sphinx.

source: LVGL does **not** recalculate coordinates immediately after a change.
it_it: LVGL **non** ricalcola le coordinate immediatamente dopo una modifica.

source: LVGL does not implement CSS completely, but a comparable subset is provided (sometimes with minor adjustments).
it_it: LVGL non implementa completamente i CSS, ma ne fornisce un sottoinsieme comparabile (a volte con piccole modifiche).

source: LVGL doesn't start, randomly crashes or nothing is drawn on the display.
it_it: LVGL non si avvia, si blocca casualmente o non viene visualizzato nulla sul display.

source: LVGL enables graphics in our free GUI Guider UI tool.
it_it: LVGL abilita la grafica nel tool gratuito "GUI Guider".

source: LVGL features a renderer for EVE.
it_it: LVGL include un renderer per EVE.

source: LVGL finds the nearest scroll point;
it_it: LVGL trova il punto di scorrimento più vicino;

source: LVGL follows the CSS ``border-box`` model:
it_it: LVGL segue il modello CSS ``border-box``:

source: LVGL has a "File system" abstraction module that enables you to attach any type of file system.
it_it: LVGL dispone di un modulo di astrazione del "File system" che consente di collegare qualsiasi tipo di file system.

source: LVGL has a built-in *Logging* module to inform the user about what is happening in the library.
it_it: LVGL ha un modulo *Logging* integrato per informare l'utente su ciò che accade nella libreria.

source: LVGL has a built-in Timer system.
it_it: LVGL ha un sistema di Timer integrato.

source: LVGL has a built-in XML parser that can create UIs at runtime
it_it: LVGL ha un parser XML integrato che può creare interfacce utente a runtime

source: LVGL has a built-in trace system to track and record the timestamps of important events that occur during runtime, such as rendering events and user input events.
it_it: LVGL dispone di un sistema di "tracing" nativo per tracciare e registrare i timestamp di eventi importanti che si verificano durante l'esecuzione, come eventi di rendering ed eventi di input utente.

source: LVGL has built-in support for many built-in drivers (see :ref:`integration_index`), but it's easy to initialize a display from scratch as well (as shown above).
it_it: LVGL supporta molti driver integrati (vedere :ref:`integration_index`), ma è anche facile inizializzare un display da zero (come mostrato sopra).

source: LVGL has built-in support to improve the performance of software rendering by utilizing Neon instructions.
it_it: LVGL ha un supporto integrato per migliorare le prestazioni del rendering software utilizzando le istruzioni Neon.

source: LVGL has good support for the graphical hardware acceleration peripherals that some STM32 models feature.
it_it: LVGL offre un buon supporto per le periferiche di accelerazione hardware grafica di cui sono dotati alcuni modelli STM32.

source: LVGL has internally set up some hooks for performance measurement to help developers analyze and locate performance issues.
it_it: LVGL ha configurato internamente alcuni hook per la misurazione delle prestazioni per aiutare gli sviluppatori ad analizzare e individuare i problemi di prestazioni.

source: LVGL has its own configuration file called ``lv_conf.h``.
it_it: LVGL ha un proprio file di configurazione chiamato ``lv_conf.h``.

source: LVGL has registered as a `softwarepackage <https://packages.rt-thread.org/en/detail.html?package=LVGL>`__ of RT-Thread.
it_it: LVGL è registrato come `softwarepackage <https://packages.rt-thread.org/en/detail.html?package=LVGL>`__ di RT-Thread.

source: LVGL has the ability to recognize multi-touch gestures.
it_it: LVGL è in grado di riconoscere i gesti multi-touch.

source: LVGL includes CMake natively, which means that one can use it to configure and build LVGL directly or integrate it into a higher level cmake build.
it_it: LVGL include CMake in modo nativo, il che significa che è possibile utilizzarlo per configurare e compilare LVGL direttamente o integrarlo in una build CMake di livello superiore.

source: LVGL includes `Material Design's palette <https://vuetifyjs.com/en/styles/colors/#material-colors>`__ of colors.
it_it: LVGL include la `palette di Material Design <https://vuetifyjs.com/en/styles/colors/#material-colors>`__ di colori.

source: LVGL includes built-in support for OpenGL ES through the GLFW driver, which provides cross-platform window management and OpenGL context creation.
it_it: LVGL include il supporto integrato per OpenGL ES tramite il driver GLFW, che fornisce la gestione multipiattaforma delle finestre e la creazione di contesti OpenGL.

source: LVGL integrates DMA2D as a :ref:`draw unit <draw units>`.
it_it: LVGL integra DMA2D come :ref:`unità di disegno <draw units>`.

source: LVGL integrates NeoChrom as a :ref:`draw unit <draw units>`.
it_it: LVGL integra NeoChrom come :ref:`unità draw <draw units>`.

source: LVGL integrates a VG-Lite GPU simulator based on ThorVG.
it_it: LVGL integra un simulatore di GPU VG-Lite basato su ThorVG.

source: LVGL integrates a VG-Lite simulator based on ThorVG.
it_it: LVGL integra un simulatore VG-Lite basato su ThorVG.

source: LVGL is **not thread-safe**.
it_it: LVGL **non è thread-safe**.

source: LVGL is a free and open-source embedded graphic library with features that enable you to create embedded GUIs with intuitive graphical elements, beautiful visual effects and a low memory footprint.
it_it: LVGL è una libreria grafica embedded gratuita e open source con funzionalità che consentono di creare GUI embedded con elementi grafici intuitivi, splendidi effetti visivi e un ridotto utilizzo di memoria.

source: LVGL is a git submodule inside `lv_micropython <https://github.com/lvgl/lv_micropython>`__ (LVGL is a git submodule of `lv_binding_micropython <https://github.com/lvgl/lv_binding_micropython>`__ which is itself a submodule of `lv_micropython <https://github.com/lvgl/lv_micropython>`__).
it_it: LVGL è un sottomodulo git all'interno di `lv_micropython <https://github.com/lvgl/lv_micropython>`__ (LVGL è un sottomodulo git di `lv_binding_micropython <https://github.com/lvgl/lv_binding_micropython>`__ che a sua volta è un sottomodulo di `lv_micropython <https://github.com/lvgl/lv_micropython>`__).

source: LVGL is an `Object-Oriented Component Based <https://blog.lvgl.io/2018-12-13/extend-lvgl-objects>`__ high-level GUI library, that could fit very well for a RTOS with advanced features like NuttX.
it_it: LVGL è una libreria GUI di alto livello `Basata su Componenti Object-Oriented <https://blog.lvgl.io/2018-12-13/extend-lvgl-objects>`__, che potrebbe adattarsi perfettamente a un RTOS con funzionalità avanzate come NuttX.

source: LVGL is an `Object-Oriented Component Based <https://blog.lvgl.io/2018-12-13/extend-lvgl-objects>`__ high-level GUI library, which is a natural candidate to map into a higher level language, such as Python.
it_it: LVGL è una libreria GUI di alto livello `Basata su Componenti Object-Oriented <https://blog.lvgl.io/2018-12-13/extend-lvgl-objects>`__ che è una candidata naturale per essere mappata in un linguaggio di livello superiore, come Python.

source: LVGL is available for `VSCode <https://code.visualstudio.com/>`__, a well-known cross-platform code editor.
it_it: LVGL è disponibile per `VSCode <https://code.visualstudio.com/>`__, un noto editor di codice multipiattaforma.

source: LVGL is available on GitHub: https://github.com/lvgl/lvgl.
it_it: LVGL è disponibile su GitHub: https://github.com/lvgl/lvgl.
